In [1]:
import pandas as pd

In [19]:
df = pd.read_csv("https://raw.githubusercontent.com/codebasics/math-for-machine-learning/main/4_mean_percentile/income.csv")
df.head()

    Name  Monthly Income ($)
0    Rob                5000
1  Rafiq                6000
2   Nina                4000
3  Sofia                7500
4  Mohan                8000

In [3]:
df.describe()

       Monthly Income ($)
count        7.000000e+00
mean         1.433929e+06
std          3.777283e+06
min          4.000000e+03
25%          5.500000e+03
50%          7.000000e+03
75%          7.750000e+03
max          1.000000e+07

In [4]:
df

        Name  Monthly Income ($)
0        Rob                5000
1      Rafiq                6000
2       Nina                4000
3      Sofia                7500
4      Mohan                8000
5        Tao                7000
6  Elon Musk            10000000

In [5]:
df["Monthly Income ($)"].mean()

1433928.5714285714

In [6]:
df["Monthly Income ($)"].median()

7000.0

In [7]:
df["Monthly Income ($)"].mode()

0        4000
1        5000
2        6000
3        7000
4        7500
5        8000
6    10000000
dtype: int64

In [21]:
percentile_99 = df["Monthly Income ($)"].quantile(.99)
percentile_99

9400479.999999994

In [24]:
df_no_outlier = df[df["Monthly Income ($)"]<=percentile_99]
df_no_outlier

    Name  Monthly Income ($)
0    Rob                5000
1  Rafiq                6000
2   Nina                4000
3  Sofia                7500
4  Mohan                8000
5    Tao                7000

In [30]:
import numpy as np
df["Monthly Income ($)"][3]=np.NaN

<ipython-input-30-ea2f2dc5f018>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Monthly Income ($)"][3]=np.NaN
/Users/jyotiranjanjally/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [31]:
df

        Name  Monthly Income ($)
0        Rob              5000.0
1      Rafiq              6000.0
2       Nina              4000.0
3      Sofia                 NaN
4      Mohan              8000.0
5        Tao              7000.0
6  Elon Musk          10000000.0

In [32]:
df_new = df.fillna(df["Monthly Income ($)"].mean())
df_new

        Name  Monthly Income ($)
0        Rob        5.000000e+03
1      Rafiq        6.000000e+03
2       Nina        4.000000e+03
3      Sofia        1.671667e+06
4      Mohan        8.000000e+03
5        Tao        7.000000e+03
6  Elon Musk        1.000000e+07

In [33]:
df_new = df.fillna(df["Monthly Income ($)"].median())
df_new

        Name  Monthly Income ($)
0        Rob              5000.0
1      Rafiq              6000.0
2       Nina              4000.0
3      Sofia              6500.0
4      Mohan              8000.0
5        Tao              7000.0
6  Elon Musk          10000000.0